{
    "overview": {
        "summary": "Software Engineer with experience across backend development, cloud infrastructure, and data engineering within regulated enterprise environments. Has worked on production microservices, large-scale AWS governance automation, and Snowflake-based data ingestion platforms. Combines strong software engineering foundations with applied machine learning and agentic AI system development experience.",
        "current_role": "Data Engineer at NatWest Group",
        "location": "Edinburgh, United Kingdom",
        "career_focus": "Focused on AI engineering and agentic system design, building controlled, reliable AI-driven applications grounded in strong software engineering principles."
    },

    "experience": {
        "natwest_data_engineer": {
            "company": "NatWest Group",
            "title": "Data Engineer",
            "employment_type": "Full-time",
            "start_date": "January 2026",
            "end_date": "Current Role",
            "summary": "Data Engineer within the Retail and Affluent Customer Data (RAD CDE) team at NatWest Group, supporting enterprise data ingestion and Snowflake-based analytics initiatives. Works with internal stakeholders to onboard data from S3 and other internal sources into Snowflake, contributing to the central data platform used across retail and affluent banking.",
            "highlights": ["Collaborates with internal stakeholders to ingest and onboard data from S3 and other enterprise sources into Snowflake.",
                        "Writes and optimises SQL within Snowflake to validate, transform and structure ingested datasets.",
                        "Contributes to the Retail and Affluent Customer Data Engineering (RAD CDE) team responsible for enabling data access across multiple business units.",
                        "Engages in exploratory discussions on the potential application of agentic AI solutions to improve internal business processes.",
                        "Undertaking structured Snowflake training to deepen platform-specific knowledge within an enterprise banking environment."],
            "technologies": [ "SQL",
                            "Snowflake",
                            "Amazon S3",
                            "Git",
                            "GitLab",
                            "VSCode"]
        },
        "natwest_java_backend_engineer": {
            "company": "NatWest Group",
            "title": "Java Backend Engineer",
            "employment_type": "Full-time",
            "start_date": "July 2025",
            "end_date": "December 2025",
            "summary": "Backend Engineer within the Click to Pay (Debit Cards) domain at NatWest Group, contributing to a production event-driven microservice responsible for retrying failed foreign currency purchase notifications. Worked on extracting retry logic into a standalone Java/Spring Boot service, enhancing reliability, test coverage, and configuration management within a regulated banking environment.",
            "highlights": ["Extracted foreign currency notification retry logic into a standalone Java/Spring Boot microservice with CRON-based scheduling.",
                        "Contributed to a production event-driven service responsible for recalculating exchange rates and notifying customers of non-GBP transactions.",
                        "Configured H2 databases by adapting SQL and implementing data-seeding routines to mirror production workflows.",
                        "Achieved 86% unit test coverage through comprehensive JUnit test suites validated using JaCoCo.",
                        "Developed a custom Spring Profile loader to securely map environment variables into application.yml configurations."],
            "technologies": ["Java",
                            "Spring Boot",
                            "REST APIs",
                            "Event-Driven Microservices",
                            "H2 Database",
                            "JUnit",
                            "JaCoCo",
                            "CRON Scheduling",
                            "Git"]
        },
        "natwest_infrastructure_engineer": {
            "company": "NatWest Group",
            "title": "Infrastructure Engineer",
            "employment_type": "Full-time",
            "start_date": "January 2025",
            "end_date": "July 2025",
            "summary": "Infrastructure Engineer within NatWest Group, supporting governance and compliance across 800+ AWS accounts. Developed automation tooling using Python and Boto3 to improve visibility into custom AWS Config rules and Security Hub findings, contributing to stronger cloud security posture within a regulated banking environment.",
            "highlights": ["Automated compliance reporting for custom AWS Config rules across 800+ AWS accounts, surfacing results through Amazon QuickSight dashboards.",
                        "Developed Python (Boto3) automation scripts to audit and validate 50+ custom Config rules, ensuring correct handling of deleted resources.",
                        "Investigated AWS Security Hub findings, identifying and remediating non-compliant resources and overly permissive IAM policies.",
                        "Built a suppressed resource tracking tool to improve stakeholder visibility into governance exceptions.",
                        "Achieved AWS Solutions Architect Associate certification during placement."],
            "technologies": ["AWS",
                            "AWS Config",
                            "AWS Security Hub",
                            "Amazon QuickSight",
                            "IAM",
                            "Infrastructure Governance",
                            "Cloud Compliance",
                            "Python",
                            "Boto3"]
        },
        "natwest_bootcamp_trainee": {
            "company": "NatWest Group",
            "title": "Graduate Software Engineer",
            "employment_type": "Full-time",
            "start_date": "September 2024",
            "end_date": "December 2024",
            "summary": "Completed a structured three-month graduate bootcamp at NatWest Group covering foundational software engineering concepts, including programming fundamentals, web development, backend services, data processing, cloud principles, and cybersecurity awareness.",
            "highlights": ["Completed introductory modules in HTML and CSS for basic front-end development.",
                        "Built simple backend services using Java and Spring Boot as part of foundational training.",
                        "Explored Python for basic data processing and scripting tasks.",
                        "Received introductory exposure to cloud computing concepts and cybersecurity best practices.",
                        "Represented NatWest at university career fairs to support early talent engagement.",
                        "Helped organise professional development and certification-focused events within the graduate cohort.",
                        "Acted as a buddy to an intern and junior graduate, supporting onboarding and integration into the programme."],
            "technologies": [ "Java",
                            "Spring Boot",
                            "Python",
                            "HTML",
                            "CSS",
                            "Cloud Fundamentals",
                            "Cybersecurity Fundamentals"]
        },
        "babcock_java_backend_engineer": {
            "company": "Babcock",
            "title": "Java Backend Engineer",
            "employment_type": "Full-time",
            "start_date": "May 2024",
            "end_date": "August 2024",
            "summary": "Backend Engineer at Babcock, contributing to Java/Spring Boot microservices within an enterprise environment. Gained practical exposure to production backend systems through bug fixes, minor feature enhancements, and participation in Agile development workflows.",
            "highlights": ["Contributed to Java/Spring Boot microservices through targeted bug fixes and small feature enhancements.",
                        "Worked within an existing microservices architecture to understand service interactions and API design patterns.",
                        "Followed Git-based workflows using Git Bash for version control and collaboration.",
                        "Actively participated in Agile ceremonies including stand-ups and sprint planning."],
            "technologies": [  "Java",
                            "Spring Boot",
                            "Microservices",
                            "Git",
                            "Git Bash",
                            "Agile"]
        },
        "babcock_embedded_engineer": {
            "company": "Babcock",
            "title": "Embedded Engineer",
            "employment_type": "Full-time",
            "start_date": "September 2023",
            "end_date": "May 2024",
            "summary": "Embedded Engineer at Babcock, working on service development within a defence-focused environment. Derived functional and non-functional requirements from third-party technical specifications, designed service architecture using UML, and implemented a C# microservice to process and validate structured telemetry data using test-driven development principles.",
            "highlights": ["Derived functional and non-functional requirements from third-party technical specifications.",
                        "Designed service architecture using UML diagrams to structure and plan implementation.",
                        "Developed a C# microservice to parse 20-byte telemetry messages, validate checksums, and extract structured data.",
                        "Applied Test-Driven Development (TDD) using xUnit, achieving 100% unit test coverage."],
            "technologies": ["C#",
                            ".NET",
                            "xUnit",
                            "Test-Driven Development",
                            "UML",
                            "Telemetry Processing"]
        },
        "priory_healthcare_assistant": {
            "company": "The Priory Group",
            "title": "Healthcare Assistant",
            "employment_type": "Part-Time",
            "start_date": "January 2020",
            "end_date": "October 2023",
            "summary": "Part-time Healthcare Assistant supporting patients within a regulated clinical environment alongside full-time academic commitments. Worked in acute mental health settings, developing strong communication, responsibility, and situational awareness skills.",
            "highlights": [ "Supported patients within acute mental health wards, ensuring safety and adherence to care plans.",
                        "Applied de-escalation techniques in high-pressure situations to maintain a safe environment for patients and staff.",
                        "Collaborated with multidisciplinary clinical teams and external crisis services where required.",
                        "Maintained detailed and accurate documentation using clinical reporting systems.",
                        "Assisted in onboarding and guiding new staff members on ward procedures and expectations.",
                        "Managed part-time responsibilities alongside full-time academic studies, demonstrating reliability and time management."],
            "technologies": []
        }
    },

    "projects": {
        "careerbot": {
            "summary": "CareerBot is an agentic AI system designed to represent the developer's professional profile in a public-facing setting. It leverages the OpenAI Responses API with explicit tool-calling orchestration to answer recruiter-style questions about skills, experience, and projects in a controlled, non-speculative manner.",
            "problem_solved": "Traditional CVs and LinkedIn profiles are static and do not adapt to recruiter-specific questions. CareerBot was built to provide a structured, interactive way for hiring managers to explore technical experience while enforcing strict constraints around accuracy, non-fabrication, and role-focused responses.",
            "architecture": ["Built using Python with a clean, SRP-aligned module structure.",
                            "Implements explicit tool-calling orchestration using the OpenAI Responses API (no abstraction frameworks).",
                            "Maintains deterministic tool execution loops with call_id handling and duplicate output safeguards.",
                            "Uses JSONL files for structured tool side effects without introducing a database dependency.",
                            "Separates system prompt logic from injected user profile context for controlled model behaviour."],
            "technologies": ["Python",
                            "OpenAI Responses API",
                            "Gradio",
                            "JSONL",
                            "Regex-based Retrieval",
                            "Git"],
            "impact": "Demonstrates applied experience in building agentic AI systems with controlled orchestration, tool execution, and retrieval design, showcasing practical understanding of LLM behaviour beyond simple prompt engineering"
        },
        "nlp_hackathon": {
            "summary": "Built a Python-based NLP tool during an organisation-wide hackathon to identify semantically similar internal code repositories. The solution used classical vectorisation techniques to support infrastructure cost optimisation initiatives.",
            "problem_solved": "Large organisations often maintain duplicate or highly similar code repositories, leading to unnecessary infrastructure costs. The project aimed to automatically identify similar repositories using textual analysis to enable consolidation and cost reduction.",
            "architecture": ["Collected and preprocessed repository metadata and textual descriptions.",
                            "Vectorised repository text using TF-IDF to represent documents numerically.",
                            "Computed pairwise similarity using cosine similarity to identify closely related repositories.",
                            "Ranked repository similarity scores to highlight potential consolidation candidates."],
            "technologies": ["Python",
                            "TF-IDF",
                            "Cosine Similarity",
                            "Scikit-learn",
                            "Text Preprocessing"],
            "impact": "Placed 4th out of 120+ teams in an organisation-wide hackathon, demonstrating practical application of NLP techniques to a real infrastructure optimisation challenge."
        },
        "bert_dissertation": {
            "summary": "MSc Computer Science dissertation focused on evaluating transformer-based and classical machine learning approaches for depression detection in conversational text. Compared pretrained BERT, fine-tuned BERT, and a custom logistic regression model to assess performance and computational trade-offs.",
            "problem_solved": "The project aimed to determine the most effective and computationally efficient method for detecting depressive language patterns in chatbot-style text. It evaluated transformer-based models against a classical logistic regression baseline to balance predictive performance and inference speed.",
            "architecture": ["Preprocessed conversational text data including cleaning and tokenisation.",
                            "Implemented a logistic regression baseline model for supervised text classification.",
                            "Evaluated pretrained BERT without fine-tuning as a performance benchmark.",
                            "Fine-tuned a BERT transformer model for improved classification accuracy.",
                            "Compared model performance using classification metrics and analysed inference speed trade-offs."],
            "technologies": ["Python",
                            "BERT",
                            "HuggingFace Transformers",
                            "PyTorch",
                            "Logistic Regression",
                            "Natural Language Processing",
                            "Text Classification"],
            "impact": "Demonstrated the trade-off between model accuracy and computational efficiency: fine-tuned BERT achieved the highest predictive performance but incurred higher inference cost, while logistic regression delivered comparable performance with significantly lower computational overhead."
        }
    },

    "skills": {
        "languages": ["Java",
                    "Python",
                    "C#",
                    "SQL"],
        "frameworks_libraries": ["Spring Boot",
                                ".NET",
                                "HuggingFace Transformers",
                                "PyTorch",
                                "Scikit-learn",
                                "JUnit",
                                "xUnit"],
        "databases": ["Snowflake",
                    "H2"],
        "cloud_devops": ["AWS",
                        "AWS Config",
                        "AWS Security Hub",
                        "Amazon QuickSight",
                        "IAM",
                        "Boto3",
                        "S3"],
        "data_ml": ["BERT",
                    "Logistic Regression",
                    "TF-IDF",
                    "Cosine Similarity",
                    "Text Classification",
                    "Data Processing"],
        "tooling": ["Git",
                    "GitLab",
                    "VSCode",
                    "IntelliJ",
                    "PyCharm",
                    "JaCoCo"
],
        "concepts": ["Microservices Architecture",
                    "Event-Driven Systems",
                    "Test-Driven Development (TDD)",
                    "Cloud Governance",
                    "Compliance Automation",
                    "Enterprise Data Ingestion",
                    "Model Evaluation & Performance Trade-offs"]
    },

    "education": {
        "masters": {
            "degree": "MSc Computer Science",
            "institution": "University of Birmingham",
            "focus": "Advanced software engineering, machine learning, and systems design.",
            "key_modules":["Machine Learning",
                        "Artificial Intelligence",
                        "Software Engineering",
                        "Data Structures & Algorithms"],
            "thesis": "Evaluated pretrained and fine-tuned BERT models against a custom logistic regression baseline for depression detection in conversational text, analysing performance and computational trade-offs."
        },
        "undergraduate": {
            "degree": "BSc Psychology",
            "institution": "University of West London",
            "focus": "Cognitive psychology, research methods, and statistical analysis.",
            "key_modules": ["Research Methods",
                        "Statistics",
                        "Cognitive Psychology",
                        "Neuroscience"]

        }
    },

    "certifications": ["AWS Solutions Architect Associate", "Google Data Analytics Specialisation"],

    "preferences": {
        "roles_targeted": ["AI Engineer", "ML Engineer", "Back End Engineer", "Data Engineer", "Software Engineer"],
        "location_preferences": ["London, UK", "Edinburgh, UK", "Montreal, Canada", "Toronto, Canada", "Remote, UK", "Remote, Canada"],
        "working_style": "Remote, hyrbid, or office-based"
    }
}
